McMCCRU/rtl8188gu/hal/rtl8710b/rtl8710b_hal_init.c
/******************************************************************************
 *
 * Copyright(c) 2007 - 2017 Realtek Corporation.
 *
 * This program is free software; you can redistribute it and/or modify it
 * under the terms of version 2 of the GNU General Public License as
 * published by the Free Software Foundation.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for
 * more details.
 *
 *****************************************************************************/
#define _HAL_INIT_C_

#include <rtl8710b_hal.h>
#include "hal_com_h2c.h"
#include <hal_com.h>
#include "hal8710b_fw.h"

#ifndef CONFIG_DLFW_TXPKT
#define DL_FW_MAX 5
#else
#define FW_DOWNLOAD_SIZE_8710B 8192
#endif

#ifdef CONFIG_FILE_FWIMG
	u8 FwBuffer[FW_8710B_SIZE];
#endif

static VOID _FWDownloadEnable(PADAPTER padapter, BOOLEAN enable)
{
	u8 tmp;

	if (enable) {
		// MCU firmware download enable.
		rtw_write8(padapter, REG_8051FW_CTRL_V1_8710B | PAGE0_OFFSET, 0x05);	
		tmp = rtw_read8(padapter, (REG_8051FW_CTRL_V1_8710B + 3) | PAGE0_OFFSET);
		tmp |= BIT0;
		rtw_write8(padapter, (REG_8051FW_CTRL_V1_8710B+3) | PAGE0_OFFSET, tmp);	
		
		// Clear Rom DL enable
		tmp = rtw_read8(padapter, (REG_8051FW_CTRL_V1_8710B+2) | PAGE0_OFFSET);
		rtw_write8(padapter, (REG_8051FW_CTRL_V1_8710B+2) | PAGE0_OFFSET, tmp&0xf7);
	} else {
		// MCU firmware download enable.
		tmp = rtw_read8(padapter, REG_8051FW_CTRL_V1_8710B | PAGE0_OFFSET);
		rtw_write8(padapter, REG_8051FW_CTRL_V1_8710B | PAGE0_OFFSET, tmp&0xfe);
	}
}

static int _BlockWrite(PADAPTER padapter, PVOID buffer, u32 buffSize)
{
	int ret = _SUCCESS;

	u32			blockSize_p1 = 4;	/* (Default) Phase #1 : PCI muse use 4-byte write to download FW */
	u32			blockSize_p2 = 8;	/* Phase #2 : Use 8-byte, if Phase#1 use big size to write FW. */
	u32			blockSize_p3 = 1;	/* Phase #3 : Use 1-byte, the remnant of FW image. */
	u32			blockCount_p1 = 0, blockCount_p2 = 0, blockCount_p3 = 0;
	u32			remainSize_p1 = 0, remainSize_p2 = 0;
	u8			*bufferPtr	= (u8 *)buffer;
	u32			i = 0, offset = 0;
#if 0
#ifdef CONFIG_USB_HCI
	blockSize_p1 = 254;
#endif
#endif
	/* 3 Phase #1 */
	blockCount_p1 = buffSize / blockSize_p1;
	remainSize_p1 = buffSize % blockSize_p1;

	for (i = 0; i < blockCount_p1; i++) {
#if 0
#ifdef CONFIG_USB_HCI
		ret = rtw_writeN(padapter, (FW_8710B_START_ADDRESS + i * blockSize_p1), blockSize_p1, (bufferPtr + i * blockSize_p1));
#else
		ret = rtw_write32(padapter, (FW_8710B_START_ADDRESS + i * blockSize_p1), le32_to_cpu(*((u32 *)(bufferPtr + i * blockSize_p1))));
#endif
#endif
		ret = rtw_write32(padapter, (FW_8710B_START_ADDRESS + i * blockSize_p1), le32_to_cpu(*((u32 *)(bufferPtr + i * blockSize_p1))));
		if (ret == _FAIL) {
			RTW_ERR("====>%s %d i:%d\n", __func__, __LINE__, i);
			goto exit;
		}
	}

	/* 3 Phase #2 */
	if (remainSize_p1) {
		offset = blockCount_p1 * blockSize_p1;

		blockCount_p2 = remainSize_p1 / blockSize_p2;
		remainSize_p2 = remainSize_p1 % blockSize_p2;
#if 0
#ifdef CONFIG_USB_HCI
		for (i = 0; i < blockCount_p2; i++) {
			ret = rtw_writeN(padapter, (FW_8710B_START_ADDRESS + offset + i * blockSize_p2), blockSize_p2, (bufferPtr + offset + i * blockSize_p2));

			if (ret == _FAIL)
				goto exit;
		}
#endif
#endif
	}

	/* 3 Phase #3 */
	if (remainSize_p2) {

		offset = (blockCount_p1 * blockSize_p1) + (blockCount_p2 * blockSize_p2);
		blockCount_p3 = remainSize_p2 / blockSize_p3;

		for (i = 0 ; i < blockCount_p3 ; i++) {
			ret = rtw_write8(padapter, (FW_8710B_START_ADDRESS + offset + i), *(bufferPtr + offset + i));

			if (ret == _FAIL) {
				RTW_ERR("====>%s %d i:%d\n", __func__, __LINE__, i);
				goto exit;
			}
		}
	}

exit:
	return ret;
}

static int _PageWrite(PADAPTER	padapter, u32 page, PVOID buffer, u32 size)
{
	u8 value8;
	u8 u8Page = (u8)(page & 0x07);

	value8 = (rtw_read8(padapter, REG_8051FW_CTRL_V1_8710B + 2) & 0xF8) | u8Page;
	rtw_write8(padapter, REG_8051FW_CTRL_V1_8710B + 2, value8);

	return _BlockWrite(padapter, buffer, size);
}

static int _WriteFW(PADAPTER padapter, PVOID buffer, u32 size)
{
	/* Since we need dynamic decide method of dwonload fw, so we call this function to get chip version. */
	int ret = _SUCCESS;
	u32 pageNums, remainSize;
	u32 page, offset;
	u8 *bufferPtr = (u8 *)buffer;

	pageNums = size / MAX_DLFW_PAGE_SIZE;
	/* RT_ASSERT((pageNums <= 4), ("Page numbers should not greater then 4\n")); */
	remainSize = size % MAX_DLFW_PAGE_SIZE;

	for (page = 0; page < pageNums; page++) {
		offset = page * MAX_DLFW_PAGE_SIZE;
		ret = _PageWrite(padapter, page, bufferPtr + offset, MAX_DLFW_PAGE_SIZE);

		if (ret == _FAIL) {
			RTW_ERR("====>%s %d\n", __func__, __LINE__);
			goto exit;
		}
	}
	if (remainSize) {
		offset = pageNums * MAX_DLFW_PAGE_SIZE;
		page = pageNums;
		ret = _PageWrite(padapter, page, bufferPtr + offset, remainSize);

		if (ret == _FAIL) {
			RTW_ERR("====>%s %d\n", __func__, __LINE__);
			goto exit;
		}
	}

exit:
	return ret;
}

void _8051Reset8710(PADAPTER padapter)
{
	u8 value8;
	
	value8 = rtw_read8(padapter, (REG_8051FW_CTRL_V1_8710B+3) | PAGE0_OFFSET);
	rtw_write8(padapter,  (REG_8051FW_CTRL_V1_8710B+3) | PAGE0_OFFSET, value8&(~BIT0));

	rtw_udelay_os(50);

	value8 = rtw_read8(padapter,  (REG_8051FW_CTRL_V1_8710B+3) | PAGE0_OFFSET);
	rtw_write8(padapter,  (REG_8051FW_CTRL_V1_8710B+3) | PAGE0_OFFSET, value8|(BIT0));
}

static s32 polling_fwdl_chksum(_adapter *adapter, u32 min_cnt, u32 timeout_ms)
{
	s32 ret = _FAIL;
	u32 value32;
	systime start = rtw_get_current_time();
	u32 cnt = 0;

	/* polling CheckSum report */
	do {
		cnt++;
		value32 = rtw_read32(adapter, REG_8051FW_CTRL_V1_8710B);
		if (value32 & FWDL_ChkSum_rpt || RTW_CANNOT_IO(adapter))
			break;
		rtw_yield_os();
	} while (rtw_get_passing_time_ms(start) < timeout_ms || cnt < min_cnt);

	if (!(value32 & FWDL_ChkSum_rpt))
		goto exit;

	if (rtw_fwdl_test_trigger_chksum_fail())
		goto exit;

	ret = _SUCCESS;

