McMCCRU/rtl8188gu/hal/rtl8710b/rtl8710b_hal_init.c
	/*	RTW_INFO("%s\n", __FUNCTION__); */
	EFUSE_GetEfuseDefinition(padapter, efuseType, TYPE_AVAILABLE_EFUSE_BYTES_BANK, &efuse_max_available_len, bPseudoTest);

	efuse_addr = *pAddr;
	if (efuse_addr >= efuse_max_available_len) {
		RTW_INFO("%s: addr(%d) over available(%d)!!\n", __FUNCTION__, efuse_addr, efuse_max_available_len);
		return _FALSE;
	}

	pg_header = ((pTargetPkt->offset & 0x07) << 5) | 0x0F;
	/*	RTW_INFO("%s: pg_header=0x%x\n", __FUNCTION__, pg_header); */

	do {
		efuse_OneByteWrite(padapter, efuse_addr, pg_header, bPseudoTest);
		efuse_OneByteRead(padapter, efuse_addr, &tmp_header, bPseudoTest);
		if (tmp_header != 0xFF)
			break;
		if (repeatcnt++ > EFUSE_REPEAT_THRESHOLD_) {
			RTW_INFO("%s: Repeat over limit for pg_header!!\n", __FUNCTION__);
			return _FALSE;
		}
	} while (1);

	if (tmp_header != pg_header) {
		RTW_INFO(KERN_ERR "%s: PG Header Fail!!(pg=0x%02X read=0x%02X)\n", __FUNCTION__, pg_header, tmp_header);
		return _FALSE;
	}

	/* to write ext_header */
	efuse_addr++;
	pg_header = ((pTargetPkt->offset & 0x78) << 1) | pTargetPkt->word_en;

	do {
		efuse_OneByteWrite(padapter, efuse_addr, pg_header, bPseudoTest);
		efuse_OneByteRead(padapter, efuse_addr, &tmp_header, bPseudoTest);
		if (tmp_header != 0xFF)
			break;
		if (repeatcnt++ > EFUSE_REPEAT_THRESHOLD_) {
			RTW_INFO("%s: Repeat over limit for ext_header!!\n", __FUNCTION__);
			return _FALSE;
		}
	} while (1);

	if (tmp_header != pg_header) {	/* offset PG fail */
		RTW_INFO(KERN_ERR "%s: PG EXT Header Fail!!(pg=0x%02X read=0x%02X)\n", __FUNCTION__, pg_header, tmp_header);
		return _FALSE;
	}

	*pAddr = efuse_addr;

	return _TRUE;
}

static u8
hal_EfusePgPacketWriteHeader(
	PADAPTER		padapter,
	u8				efuseType,
	u16				*pAddr,
	PPGPKT_STRUCT	pTargetPkt,
	u8				bPseudoTest)
{
	u8 bRet = _FALSE;

	if (pTargetPkt->offset >= EFUSE_MAX_SECTION_BASE)
		bRet = hal_EfusePgPacketWrite2ByteHeader(padapter, efuseType, pAddr, pTargetPkt, bPseudoTest);
	else
		bRet = hal_EfusePgPacketWrite1ByteHeader(padapter, efuseType, pAddr, pTargetPkt, bPseudoTest);

	return bRet;
}

static u8
hal_EfusePgPacketWriteData(
	PADAPTER		padapter,
	u8				efuseType,
	u16				*pAddr,
	PPGPKT_STRUCT	pTargetPkt,
	u8				bPseudoTest)
{
	u16	efuse_addr;
	u8	badworden;


	efuse_addr = *pAddr;
	badworden = Efuse_WordEnableDataWrite(padapter, efuse_addr + 1, pTargetPkt->word_en, pTargetPkt->data, bPseudoTest);
	if (badworden != 0x0F) {
		RTW_INFO("%s: Fail!!\n", __FUNCTION__);
		return _FALSE;
	}

	/*	RTW_INFO("%s: ok\n", __FUNCTION__); */
	return _TRUE;
}

static s32
Hal_EfusePgPacketWrite(
	PADAPTER	padapter,
	u8			offset,
	u8			word_en,
	u8			*pData,
	u8			bPseudoTest)
{
	PGPKT_STRUCT targetPkt;
	u16 startAddr = 0;
	u8 efuseType = EFUSE_WIFI;

	if (!hal_EfusePgCheckAvailableAddr(padapter, efuseType, bPseudoTest))
		return _FALSE;

	hal_EfuseConstructPGPkt(offset, word_en, pData, &targetPkt);

	if (!hal_EfusePartialWriteCheck(padapter, efuseType, &startAddr, &targetPkt, bPseudoTest))
		return _FALSE;

	if (!hal_EfusePgPacketWriteHeader(padapter, efuseType, &startAddr, &targetPkt, bPseudoTest))
		return _FALSE;

	if (!hal_EfusePgPacketWriteData(padapter, efuseType, &startAddr, &targetPkt, bPseudoTest))
		return _FALSE;

	return _TRUE;
}

/* 
* efuse read   											
* 1) write 0x80F8: 0x000000xx =>xx is efuse physical address  	
* 2) write 0x806C: 0x85000000  							
* 3) poll bit31  											
* 4) read 0x809C: 0x000000yy => yy is efuse physical data  		
*/
BOOLEAN hal_efuse_read4_8710b(PADAPTER padapter, u16 regaddr, u8 *value)
{
	BOOLEAN ret = _TRUE;
	u8 pollint_count;
	u32 value32, reg_value32;
	HAL_DATA_TYPE *pHalData = GET_HAL_DATA(padapter);

	reg_value32 =0xFFFFFFFF;
	pollint_count = 0xFF;

	rtw_write32(padapter, REG_USB_HOST_INDIRECT_ADDR_8710B, regaddr);
	rtw_write32(padapter, REG_EFUSE_INDIRECT_CTRL_8710B, EFUSE_READ_OFFSET);
	
	do {
		value32 = rtw_read32(padapter, REG_EFUSE_INDIRECT_CTRL_8710B);
	}
	while ((value32 & BIT31) && (pollint_count-- > 0));

	if (pollint_count == 0) {
		RTW_ERR("Error: Polling 0x6c[31] fail, 0x6c = 0x%x\n", value32);
		ret = _FALSE;
	}
	else {
		reg_value32 = rtw_read32(padapter, REG_USB_HOST_INDIRECT_DATA_8710B);
		*value = (u8)reg_value32 & 0xFF; 
	}
	
	return ret;
}

#if 0
// Peter, TODO : cant use. Need modify
/* efuse write												*/
/* 1) write 0x80F8: 0x000000xx =>xx is efuse physical address	*/
/* 2) write 0x809C: 0x000000yy => yy is efuse physical data		*/
/* 3) write 0x806C: 0x86000000								*/
/* 4) poll bit31											*/
BOOLEAN hal_efuse_write4(PADAPTER padapter, u16 offset, u8 value)
{
	BOOLEAN bRetVaule = TRUE;
	u4Byte	u4Temp = 0;
	u1Byte u1PollingCnt = 0xFF;
	RT_TRACE(COMP_EFUSE, DBG_LOUD, ("Hal_EfuseOneByteWrite_8710B() offset = 0x%x, value= 0x%x\n", offset,value));
	
	PlatformEFIOWrite4Byte(padapter, REG_USB_HOST_INDIRECT_ADDR_8710B, offset);
	PlatformEFIOWrite4Byte(padapter, REG_USB_HOST_INDIRECT_DATA_8710B, value);
	PlatformEFIOWrite4Byte(padapter, REG_EFUSE_INDIRECT_CTRL_8710B, 0x86000000);

	do
	{
		u4Temp = PlatformEFIORead4Byte(padapter, REG_EFUSE_INDIRECT_CTRL_8710B);
	}
	while((u4Temp & BIT31) && (u1PollingCnt-- > 0));

	if(u1PollingCnt == 0)
	{
		RT_TRACE(COMP_EFUSE, DBG_SERIOUS, ("Hal_EfuseOneByteWrite_8710B() Error: Polling 0x6c[31] fail, 0x6c = 0x%x\n",u4Temp));
		bRetVaule = FALSE;
	}

	return bRetVaule;
}
#endif

/**
* Function:	CalculateBitShift*
* OverView:	Get shifted position of the BitMask*
* Input:*		u4Byte		BitMask,	*
* Output:		none
* Return:		u4Byte		Return the shift bit bit position of the mask
*/
u32 calculate_bitshift(u32 bitmask)
{
	u32 i;

	for (i=0; i<=31; i++) {
		if (((bitmask>>i) &  0x1 ) == 1)
			break;
	}
	return i;
}

/* 
* read any register 
* 1) write 0x80F8: 0xxxxxxxxx =>xxxxxx is register complete address		
* 2) write 0x806C: 0x83000000													
* 3) poll bit31													
* 4) read 0x809C: 0xyyyyyyyy => yyyyyyyy is register data				
*/
u32 indirect_read32_8710b(PADAPTER padapter, u32 regaddr)
{
	u32 value32, reg_value32;
	u8 pollint_count;
	HAL_DATA_TYPE *pHalData = GET_HAL_DATA(padapter);
	_mutex *mutex = &adapter_to_dvobj(padapter)->syson_indirect_access_mutex;

	reg_value32 =0xFFFFFFFF;
	pollint_count = 0xFF;
	
	/* 4 byte alignment */
	if ((regaddr & 0x00000003) != 0)
	{
		RTW_DBG("skip read reg because offset(0x%x) is not 4 byte alignment!!!\n",regaddr);
		return reg_value32;
	}	
	
	_enter_critical_mutex(mutex, NULL);

