McMCCRU/rtl8188gu/hal/rtl8710b/rtl8710b_hal_init.c
	rtw_write32(padapter, REG_USB_HOST_INDIRECT_ADDR_8710B, regaddr);
	rtw_write32(padapter, REG_EFUSE_INDIRECT_CTRL_8710B, NORMAL_REG_READ_OFFSET);

	do {
		value32 = rtw_read32(padapter, REG_EFUSE_INDIRECT_CTRL_8710B);
	}
	while ((value32 & BIT31) && (pollint_count-- > 0));

	if (pollint_count == 0) 
		RTW_ERR("Indirect_read32_8710b fail, 0x806c = 0x%x\n", value32);
	else
		reg_value32 = rtw_read32(padapter, REG_USB_HOST_INDIRECT_DATA_8710B);

	_exit_critical_mutex(mutex, NULL);

	return reg_value32;
}

/* write any register												*/
/* 1) write 0x80F8: 0xxxxxxxxx =>xxxxxx is register complete address		*/
/* 2) write 0x809C: 0xyyyyyyyy =>yyyyyyyy is register data				*/
/* 3) write 0x806C: 84000000										*/
/* 4) poll bit31													*/
VOID indirect_write32_8710b(PADAPTER padapter, u32 regaddr, u32 data)
{
	u32 value32, reg_value32;
	u8 pollint_count;
	HAL_DATA_TYPE *pHalData = GET_HAL_DATA(padapter);
	_mutex *mutex = &adapter_to_dvobj(padapter)->syson_indirect_access_mutex;

	reg_value32 =0xFFFFFFFF;
	pollint_count = 0xFF;

	//  4 byte alignment
	if((regaddr & 0x00000003) != 0)
	{
		RTW_DBG("skip write reg because offset(0x%x) is not 4 byte alignment!!!\n", regaddr);
		return;
	}
	
	_enter_critical_mutex(mutex, NULL);
	
	rtw_write32(padapter, REG_USB_HOST_INDIRECT_ADDR_8710B, regaddr);
	rtw_write32(padapter, REG_USB_HOST_INDIRECT_DATA_8710B, data);
	rtw_write32(padapter, REG_EFUSE_INDIRECT_CTRL_8710B, NORMAL_REG_WRITE_OFFSET);

	do {
		value32 = rtw_read32(padapter, REG_EFUSE_INDIRECT_CTRL_8710B);
	}
	while((value32 & BIT31) && (pollint_count-- > 0));
	
	if(pollint_count == 0)
		RTW_ERR("Indirect_write32_8710b fail, 0x806c = 0x%x\n", value32);

	_exit_critical_mutex(mutex, NULL);
	
	return;	
}

u32 hal_query_syson_reg_8710b(PADAPTER padapter, u32 regaddr, u32 bitmask)
{
	u32	ret = 0;
	u32 value32, bitshift = 0;

	/* 4 byte alignment */
	if((regaddr & 0x00000003) != 0)
	{
		RTW_DBG("skip Query SYSOn Reg because RegAddr(0x%x) is not 4 byte alignment!!!\n", regaddr);
		goto exit;
	}	
	
	RTW_DBG("--->hal_query_syson_reg_8710b(): RegAddr(%#x), BitMask(%#x)\n", regaddr, bitmask);
	
	value32 = indirect_read32_8710b(padapter, regaddr | SYSON_REG_BASE_ADDR_8710B);
	bitshift = calculate_bitshift(bitmask);
	ret = (value32 & bitmask) >> bitshift;

	RTW_DBG("<---hal_query_syson_reg_8710b(): RegAddr(%#x), BitMask(%#x), OriginalValue(%#x)\n", regaddr, bitmask, value32);

exit:
	return ret;
}

VOID hal_set_syson_reg_8710b(PADAPTER padapter, u32 regaddr, u32 bitmask, u32 data)
{
	u32 value32, bitshift = 0;

	/* 4 byte alignment */
	if ((regaddr & 0x00000003) != 0)
	{
		RTW_DBG("skip Set SYSOn Reg because RegAddr(0x%x) is not 4 byte alignment!!!\n", regaddr);
		goto exit;
	}	
	
	RTW_DBG("--->HAL_SetSYSOnReg_8710B(): RegAddr(%#x), BitMask(%#x), Data(%#x)\n", regaddr, bitmask, data);
	
	if (bitmask != bMaskDWord)
	{
		value32 = indirect_read32_8710b(padapter, regaddr | SYSON_REG_BASE_ADDR_8710B);
		bitshift = calculate_bitshift(bitmask);
		data = ((value32) & (~bitmask)) | ((data << bitshift));
	}

	indirect_write32_8710b(padapter, regaddr | SYSON_REG_BASE_ADDR_8710B, data);
	RTW_DBG("<---HAL_SetSYSOnReg_8710B(): RegAddr(%#x), BitMask(%#x), Data(%#x)\n", regaddr, bitmask, data);

exit:
	return;
}

static void read_chip_version_8710b(PADAPTER padapter)
{
	u32				value32;
	HAL_DATA_TYPE	*pHalData;

	pHalData = GET_HAL_DATA(padapter);

	value32 = hal_query_syson_reg_8710b(padapter, REG_SYS_SYSTEM_CFG0, 0xFFFFFFFF);
	pHalData->version_id.ICType = CHIP_8710B;
	pHalData->version_id.ChipType = ((value32 & BIT_RTL_ID_8710B) ? TEST_CHIP : NORMAL_CHIP);
	pHalData->version_id.CUTVersion = BIT_GET_CHIP_VER_8710B(value32);
	pHalData->version_id.VendorType = BIT_GET_VENDOR_ID_8710B(value32);
	pHalData->version_id.VendorType >>= 2;
	switch (pHalData->version_id.VendorType) {
	case 0:
		pHalData->version_id.VendorType = CHIP_VENDOR_SMIC;
		break;
	case 1:
		pHalData->version_id.VendorType = CHIP_VENDOR_TSMC;
		break;
	case 2:
		pHalData->version_id.VendorType = CHIP_VENDOR_UMC;
		break;
	}
	pHalData->version_id.RFType = RF_TYPE_1T1R;

	value32 = hal_query_syson_reg_8710b(padapter, REG_SYS_SYSTEM_CFG1, 0xFFFFFFFF);
	pHalData->RegulatorMode = ((value32 & BIT_SPSLDO_SEL_8710B) ? RT_LDO_REGULATOR : RT_SWITCHING_REGULATOR);

	value32 = hal_query_syson_reg_8710b(padapter, REG_SYS_SYSTEM_CFG2, 0xFFFFFFFF);
	pHalData->version_id.ROMVer = BIT_GET_RF_RL_ID_8710B(value32);

	pHalData->MultiFunc = RT_MULTI_FUNC_NONE;

	rtw_hal_config_rftype(padapter);

	dump_chip_info(pHalData->version_id);
}


void rtl8710b_InitBeaconParameters(PADAPTER padapter)
{
	PHAL_DATA_TYPE pHalData = GET_HAL_DATA(padapter);
	u16 val16;
	u8 val8;
	
	val8 = DIS_TSF_UDT;
	val16 = val8 | (val8 << 8); /* port0 and port1 */

#ifdef CONFIG_CONCURRENT_MODE
	val16 |= (EN_BCN_FUNCTION << 8);
#endif
	rtw_write16(padapter, REG_BCN_CTRL, val16);

	/* TBTT setup time */
	rtw_write8(padapter, REG_TBTT_PROHIBIT, TBTT_PROHIBIT_SETUP_TIME);

	/* TBTT hold time: 0x540[19:8] */
	rtw_write8(padapter, REG_TBTT_PROHIBIT + 1, TBTT_PROHIBIT_HOLD_TIME_STOP_BCN & 0xFF);
	rtw_write8(padapter, REG_TBTT_PROHIBIT + 2,
		(rtw_read8(padapter, REG_TBTT_PROHIBIT + 2) & 0xF0) | (TBTT_PROHIBIT_HOLD_TIME_STOP_BCN >> 8));

	/* Firmware will control REG_DRVERLYINT when power saving is enable, */
	/* so don't set this register on STA mode. */
	if (check_fwstate(&padapter->mlmepriv, WIFI_STATION_STATE) == _FALSE)
		rtw_write8(padapter, REG_DRVERLYINT, DRIVER_EARLY_INT_TIME_8710B); /* 5ms */
	rtw_write8(padapter, REG_BCNDMATIM, BCN_DMA_ATIME_INT_TIME_8710B); /* 2ms */

	/* Suggested by designer timchen. Change beacon AIFS to the largest number */
	/* beacause test chip does not contension before sending beacon. by tynli. 2009.11.03 */
	rtw_write16(padapter, REG_BCNTCFG, 0x660F);

}

void rtl8710b_InitBeaconMaxError(PADAPTER padapter, u8 InfraMode)
{
#ifdef CONFIG_ADHOC_WORKAROUND_SETTING
	rtw_write8(padapter, REG_BCN_MAX_ERR, 0xFF);
#else
	/* rtw_write8(Adapter, REG_BCN_MAX_ERR, (InfraMode ? 0xFF : 0x10)); */
#endif
}

static void _BeaconFunctionEnable(PADAPTER padapter, u8 Enable, u8 Linked)
{
	rtw_write8(padapter, REG_BCN_CTRL, DIS_TSF_UDT | EN_BCN_FUNCTION | DIS_BCNQ_SUB);
	rtw_write8(padapter, REG_RD_CTRL + 1, 0x6F);
}

